{
  "sortby": [
    {
      "id": 1,
      "sortBy": "increase"
    }
  ],
  "users": [
    {
      "username": "hari",
      "id": 1
    },
    {
      "username": "rio",
      "id": 2
    }
  ],
  "posts": [
    {
      "id": "hari1",
      "post_id": 1,
      "authorname": "hari",
      "title": "Iranian boat with drug consignment, 7 crew apprehended off Gujarat",
      "content": "It was carrying over 30 kg heroin worth more than ₹150 crore in the international market.\nIn a joint operation, the Indian Coast Guard and Anti-Terrorist Squad (ATS) of the Gujarat Police apprehended an Iranian boat off the Gujarat coast carrying over 30 kg heroin worth more than ₹150 crore in the international market.\n\nThere were seven crew onboard when the fishing boat entered Indian territorial waters after which it was intercepted and apprehended by the Indian agencies based on intelligence inputs.\n\nAccording to sources, the boat, seized during the operation conducted late on Saturday night, carried an estimated 30 to 50 kg of the contraband, worth about ₹150 to ₹ 250 crore in the international market, but the exact amount of the drug in the vessel will be known once the boat is anchored at a near by port and searched.\n\n\nThe crew, all Iranian nationals, have apprehended and are being taken to the port in Gujarat for further investigation.\n\n“We had credible inputs from our intelligence sources about a big drug contraband on its way for delivery in mid-sea,” said ATS DIG Himanshu Shukla.\n\n\nADVT\nADVT\n\n“On an intelligence based joint act, @IndianCoastGuard with ATS #Gujarat apprehended #Iranian boat in #Indian waters with 07 crew carrying #drugs. The boat is brought to the nearest port for further rummaging and investigations,” a defence PRO of Gujarat said on their official Twitter handle.\n\nIn last few years, Gujarat coast has become a preferred route for smuggling of drugs from Pakistan or Iran.\n\nIn April this year, eight Pakistani nationals onboard a boat were apprehended with heroin worth around ₹150 crore off the Gujarat coast in the Arabian Sea.\n\nIn January last year, five Pakistani nationals on board a fishing boat were apprehended mid-sea off the Gujarat coast while they were allegedly trying to smuggle drugs worth ₹175 crore into the State.\n\nAs many as 35 packets of heroin, each weighing 1 kg, were seized from the five men near Jakhau coast in Kutch district.\n\nSimilarly in July 2017, in one of the biggest drugs haul, an Indian Coast Guard ship seized 1,500 kg of heroin valued at about ₹3,500 crore from a merchant vessel off the Gujarat coast.",
      "views": 128,
      "upvote": 2,
      "comments": 4,
      "time": "2021/9/19 19:10:1"
    },
    {
      "id": "hari2",
      "post_id": 2,
      "authorname": "hari",
      "title": "Shooting at Russian university leaves 8 dead, 28 hurt",
      "content": "The Health Ministry of the Perm region reported that 14 people were wounded.\nA gunman opened fire on Monday at a university in Russia, leaving eight people dead and 28 hurt, officials said.",
      "views": 71,
      "upvote": 1,
      "comments": 1,
      "time": "2021/9/21 0:15:56"
    }
  ],
  "comment": [
    {
      "id": 2,
      "post_id": "hari1",
      "comment": "I too heared this ",
      "username": "rio"
    },
    {
      "id": 6,
      "post_id": "hari2",
      "comment": "I too viewed this",
      "username": "rio"
    },
    {
      "id": 7,
      "post_id": "hari1",
      "comment": "Me too heared this",
      "username": "rio"
    },
    {
      "id": 8,
      "post_id": "hari1",
      "comment": "Me too",
      "username": "rio"
    }
  ],
  "commentReply": [
    {
      "id": 1,
      "comment_id": "hari11",
      "comment": "jghjfdssfff",
      "username": "hari"
    }
  ],
  "upvote": [
    {
      "id": "hari1hari",
      "post_id": "hari1",
      "authorname": "hari"
    },
    {
      "id": "hari2hari",
      "post_id": "hari2",
      "authorname": "hari"
    },
    {
      "id": "hari1rio",
      "post_id": "hari1",
      "authorname": "rio"
    }
  ],
  "Username": [
    {
      "name": "rio",
      "id": 1
    }
  ]
}